// use("11-supasuta");

// db.foodmenu.insertMany([
//     {name: "ข้าวเกรียบกุ้ง", price: 0, description: "ข้าวเกรียบกุ้งทอดร้อนๆ 1 จาน"},
//     {name: "ทะเลนึ่งซีฟู้ด", price: 200, description: "ประกอบด้วยลูกชิ้นปลา เกี๊ยวปลา ก้ามปู เต้าหูปลา ปูอัด กุ้ง"},
//     {name: "กระเพาะปลาเนื้อปู+ไข่นกกระทา", price: 150, description: "กระเพาะปลาสูตรเข้มข้น"},
//     {name: "เป็ดย่างบะหมี่หยก", price: 200, description: "เป็ดย่างราดน้ำสูตรลับ เสิร์ฟคู่กับบะหมี่หยก"},
//     {name: "สลัดผลไม้กระทงเผือก", price: 200, description: "ผลไม้รวม 5 อย่าง แอปเปิ้ลเขียว แอปเปิ้ลแดง สับปะรด แคนตาลูป และแก้วมังกร ราดน้ำครีมสลัด พร้อมกุ้งทอด"},
//     {name: "ปลากระพงนึ่งมะนาว", price: 250, description: "ปลากระพงตัวใหญ่ใส่จานยักษ์ ราดน้ำปลาเผ็ดเปรี้ยวลงตัว"},
//     {name: "ขาหมูตุ๋น", price: 180, description: "ขาหมูตุ๋นพร้อมน้ำราด ท็อปด้วยผักคะน้าลวก"},
//     {name: "ข้าวผัดปู", price: 150, description: "ข้าวผัดจานใหญ่ โรยปูก้อน"},
//     {name: "สุกี้ทะเลรวม", price: 250, description: "สุกี้ทะเลรวม กุ้ง หมึกขาว หมึกโฟ แมงกระพรุน ลูกชิ้นปลา เกี๊ยวปลา ผักกาดขาวลวก"},
//     {name: "รวมมิตร", price: 180, description: "รวมมิตรหวานกลมกล่อม อร่อยลงตัว ทานเย็นๆ"},
// ]);

// db.foodmenu.updateMany({}, { $inc: {price: 10}});

// db.foodmenu.updateOne(
//     { _id: ObjectId("67a8068f25aa79be1fc81b94") },
//     { $set: { price: 220 } }7
// );

// db.foodmenu.deleteOne({ price: { $gt: 180 } });

// db.foodmenu.deleteMany({ price: { $gt: 150 } });

// db.foodmenu.find({ price: {$lte: 100}});